{
  "location1_1": {
    "description": "Тебя ховут Энди Дюфрейн, и тебе впояли два пожизненных срока за двойное убийство, но сам ты толком не помнишь убивал ли ты или нет, так как был пьян... Попав в тюрьму ты задумываешься о том, бежать или не бежать? Или не бежать вообще?.. Это и есть твоя первая задача, но тут еще появилась загвоздка, если я хочу сбежать, то как мне это сделать, побыстрее или сбежать через время разработав план...Это и есть твоя первая задача...",
    "picture_file_name": "media/after_start_picture.jpg",
    "picture_file_name2": "media/",
    "buttons": ["Бежать как можно быстрее.", "Сбежать через время, продумав план.", "Остаться в тюрьме отбывать два пожизненных заключения."]
  },

  "location2_1": {
    "description": "Смелое решение, возможно необдуманное, но смелое. Итак, теперь перед тобой следующий выбор:\n•Проникнуть в прачечную, украсть одежду одного из охранников, затем незаметно украсть ключи у охранника Дикинса и сбежать под видом охранника. •Спрятаться во время прогулки под лавочкой и во время загона всех по корпусам, не идти, затем перелезть через 3х метровый железный забор с уступами и пежать через поле.",
    "picture_file_name": "media/2.1__.jpg",
    "picture_file_name2": "media/Gpt1.jpg",
    "buttons": ["Украсть ключи и одежду", "Спрататься во время прогулки"]
  },
  "location3_1": {
    "description": "После обеда охранник Декинс, пытаясь зайти в уборную,замечает, что связка ключей пропала и устраивает досмотр заключенных и вас ловят с ключами охранника...",
    "picture_file_name": "media/location_3.1_var1.jpg",
    "picture_file_name2": "media/Gpt2.jpg",
    "lose_text": "Вы проиграли, если хотите попробовать еще раз, нажмите \"/start\""
  },
    "location3_2": {
    "description": "Спрятаться за лавочкой во время загона вам удалось, но вы не учли что по периметру ходят снайперы с винтовками и когда на поле для прогулок остались вы один, вас стало очень легко заметить даже с большого расстояния. Вас завели в корпус и пригрозили запретом на прием пищи в течении недели, если еще раз такое повторится(",
    "picture_file_name": "media/location_3.2_var2.jpg",
    "picture_file_name2": "media/Gpt3.jpg",
    "lose_text": "Вы проиграли, если хотите попробовать еще раз, нажмите \"/start\""
  },
    "location2_2": {
    "description": "Хороший выбор\nТеперь ты решил пробить дыру в стене и сбежать через трубу, ведущую к озерцу, находящимуся за 300-400 метров от здания тюрьмы.\nИ перед тобой следующий выбор:\n•Поближе познакомиться с Рэдом(Ирландцем , имеющим связи в тюрьме и возможность достать что угодно, например небольшой молоток)\n•Поближе познакомиться с Бруксом Хэтленом, который уже долгие годы работает в тюремной библиотеке",
    "picture_file_name": "media/locacion_2_2_question.jpg",
      "picture_file_name2": "media/gpt4.jpg",
    "buttons": ["Познакомиться с Рэдом", "Познакомиться с Бруксом"]
  },
    "location3_3": {
    "description": "Благодаря знакомству с Рэдом ты смог достать все нужные тебе вещи для побега. и благополучно сбежал из тюрьмы, затем пересек границу и остался жить на берегу тихого океана\n",
    "picture_file_name": "media/location_3.3_var1.jpg",
      "picture_file_name2": "media/gpt5.jpg",
    "win_text": "Подравляю, ты прошел квест!!!"
  },
    "location3_4": {
    "description": "Брукс конечно человек хорощий, добрый и умный, но он никаким образом в побеге тебе помочь не сможет, так что ты проиграл(",
    "picture_file_name": "media/location_3.4_var2.jpg",
      "picture_file_name2": "media/gpt6.jpg",
    "lose_text": "Вы проиграли, если хотите попробовать еще раз, нажмите \"/start\""
  },
    "location2_3": {
    "description": "Ты прожил остаток своей жизни в тюрьме и умер в старости. (Квест не пройден, но ты можешь все исправить, перезапустив его и попытавшись еще раз!)",
    "picture_file_name": "media/location_2.3_var3.jpg",
      "picture_file_name2": "media/gpt7.jpg",
    "lose_text": "Вы проиграли, если хотите попробовать еще раз, нажмите \"/start\""
  }

}